[
  {
    "codigo": 100,
    "desc": "reprehenderit in dolore Lorem ut. Consequat incididunt sunt qui ipsum tempor aliqua anim amet sit reprehenderit. Labore enim ipsum cillum mollit ullamco dolore adipisicing nisi.",
    "name": "enim fugiat",
    "marca": "COLAIRE",
    "valor": 2448.33
  },
  {
    "codigo": 101,
    "desc": "t cillum aliqua nostrud exercitation Lorem proident. Nisi fugiat aliqua est veniam consectetur eiusmod nulla magna excepteur adipisicing aliquip. Nulla sint magna non aliquip nulla.",
    "name": "sunt esse",
    "marca": "MARVANE",
    "valor": 3502.68
  },
  {
    "codigo": 102,
    "desc": "st. Adipisicing consequat amet deserunt voluptate adipisicing. Quis pariatur sint aute labore adipisicing sit veniam culpa nostrud sint.",
    "name": "labore amet",
    "marca": "AQUOAVO",
    "valor": 2962.95
  },
  {
    "codigo": 103,
    "desc": "labore elit sit sunt. Incididunt consequat magna ea ullamco. Lorem officia sunt anim in ullamco velit.",
    "name": "excepteur consequat",
    "marca": "SYNTAC",
    "valor": 1932.19
  },
  {
    "codigo": 104,
    "desc": "labore amet ut mollit do exercitation. In excepteur aliquip non adipisicing Lorem aliquip ut dolore. Occaecat dolor sunt laborum nulla mollit ullamco adipisicing Lorem duis.",
    "name": "consequat deserunt",
    "marca": "CINASTER",
    "valor": 1780.65
  },
  {
    "codigo": 105,
    "desc": "culpa incididunt elit aute quis officia. Adipisicing sit id enim aute. Aliqua incididunt ad consectetur commodo. Anim duis anim nisi officia enim.",
    "name": "amet qui",
    "marca": "FARMAGE",
    "valor": 1012.4
  },
  {
    "codigo": 106,
    "desc": " dolore ex. Ad sint consequat laboris ullamco. Aute ad mollit fugiat consequat non eiusmod tempor eu eu irure non aute aliqua. Labore officia dolor labore qui adipisicing cupidatat officia nulla.",
    "name": "laborum sunt",
    "marca": "BIOTICA",
    "valor": 3217
  },
  {
    "codigo": 107,
    "desc": "sectetur do qui ad eu elit. ui proident labore veniam proident cillum anim sunt dolore pariatur irure in consequat culpa aute",
    "name": "elit non",
    "marca": "TURNLING",
    "valor": 3086.49
  },
  {
    "codigo": 108,
    "desc": "nt ipsum est. Eiusmod pariatur laborum in sit ut labore cupidatat elit excepteur. Consectetur sunt amet aliquip cupidatat. Voluptate reprehenderit tempor incididunt exercitation fugiat.",
    "name": "consectetur labore",
    "marca": "BIZMATIC",
    "valor": 3569.15
  },
  {
    "codigo": 109,
    "desc": "rem cupidatat. Sit adipisicing aute minim ex veniam culpa nostrud culpa ullamco velit esse non eiusmod labore.",
    "name": "ipsum labore",
    "marca": "VANTAGE",
    "valor": 2095.44
  },
  {
    "codigo": 110,
    "desc": "t et magna proident cillum duis adipisicing cillum eiusmod veniam elit velit. Labore ut sunt enim in Lorem esse amet proident tempor aliquip proident nostrud aliquip. Fugiat ex elit laborum culpa proident.",
    "name": "non laboris",
    "marca": "PEARLESEX",
    "valor": 1170.91
  },
  {
    "codigo": 111,
    "desc": " reprehenderit cupidatat cillum. Nisi id eiusmod voluptate exercitation aliquip minim esse consequat consectetur minim. In mollit Lorem sunt consectetur non do nulla eu ex incididunt velit cupidatat. Sit in anim aute quis enim irure nulla et cillum irure laboris ipsum eiusmod.",
    "name": "ex ea",
    "marca": "GAPTEC",
    "valor": 1538.26
  },
  {
    "codigo": 112,
    "desc": " anim officia. Magna excepteur nostrud aliqua culpa anim ad aliquip elit aliquip esse. Veniam occaecat aute qui nisi ex reprehenderit mollit sint consequat.",
    "name": "anim eiusmod",
    "marca": "COMFIRM",
    "valor": 2321.22
  },
  {
    "codigo": 113,
    "desc": "m excepteur est cillum enim ex consectetur. Reprehenderit dolore in voluptate labore aliqua incididunt. Nisi commodo cupidatat do proident veniam ut incididunt pariatur adipisicing cupidatat non veniam deserunt officia.",
    "name": "id cillum",
    "marca": "ZENTIME",
    "valor": 1623.34
  }
]