[
  {
    "codigo": 100,
    "desc": "Culpa incididunt non consectetur laborum eiusmod nostrud qui consequat voluptate. Eiusmod mollit consequat irure ea.",
    "valor": 1187.12
  },
  {
    "codigo": 101,
    "desc": "Labore sunt et ullamco quis consectetur. Aute minim ad ea incididunt commodo eu id cupidatat eu.",
    "valor": 3166.73
  },
  {
    "codigo": 102,
    "desc": "Commodo mollit eiusmod et officia voluptate enim dolor labore officia id ad. Ea anim id aliquip anim cillum proident minim amet elit aute.",
    "valor": 2917.86
  },
  {
    "codigo": 103,
    "desc": "Ullamco cillum incididunt sit sit elit non consequat minim. Nulla et aliquip dolore cillum irure.",
    "valor": 3416.12
  },
  {
    "codigo": 104,
    "desc": "In sit do commodo commodo voluptate eiusmod magna magna id. Enim consectetur ea nostrud dolore non laborum elit elit ullamco ullamco duis ut sint adipisicing.",
    "valor": 3517.34
  },
  {
    "codigo": 105,
    "desc": "Deserunt labore culpa ullamco officia cillum id consequat cupidatat qui eu. Anim laboris incididunt officia excepteur Lorem voluptate cupidatat consequat deserunt.",
    "valor": 3696.37
  },
  {
    "codigo": 106,
    "desc": "Occaecat aliqua ipsum ad qui consequat quis excepteur amet laboris. Adipisicing quis nulla aliquip culpa.",
    "valor": 1345.78
  },
  {
    "codigo": 107,
    "desc": "Ullamco enim adipisicing duis deserunt. Culpa cillum aute pariatur eu voluptate veniam nisi.",
    "valor": 3124.72
  },
  {
    "codigo": 108,
    "desc": "Aliquip officia laboris qui reprehenderit excepteur culpa. Proident amet culpa laboris esse et.",
    "valor": 2887.22
  },
  {
    "codigo": 109,
    "desc": "Mollit tempor occaecat ad ullamco tempor aliquip nisi occaecat proident minim adipisicing elit veniam. Magna amet nostrud est excepteur aliquip laborum enim nulla in.",
    "valor": 3486.06
  },
  {
    "codigo": 110,
    "desc": "Elit velit velit amet eu eiusmod deserunt tempor dolore cillum do. Sunt deserunt culpa commodo labore sit laboris aliqua amet dolor consequat eiusmod.",
    "valor": 2140.09
  },
  {
    "codigo": 111,
    "desc": "Proident labore officia incididunt nostrud labore ad sint quis fugiat magna tempor. Qui do fugiat Lorem labore.",
    "valor": 2501.83
  },
  {
    "codigo": 112,
    "desc": "Mollit excepteur sunt irure quis tempor ad enim sunt. Id excepteur labore eu sit fugiat laboris incididunt.",
    "valor": 2655.48
  }
]